IDENTIFICATION DIVISION.
PROGRAM-ID. ACCEPTSHELL.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 CMD-LINE    PIC X(100).
*>01 RETURN-CODE PIC S9(4) COMP.

PROCEDURE DIVISION.
MAIN-PARAGRAPH.
       DISPLAY "Enter a shell command to run:"
       ACCEPT CMD-LINE

       CALL "SYSTEM" USING CMD-LINE
                     *>RETURNING RETURN-CODE

       DISPLAY "Command executed with return code: " RETURN-CODE
       STOP RUN. 